Revit 2027 API
BuiltInFailures.BendFailures.NotBentOpening Property
 While making curved beam type "[Type Name]" Opening elements were not created
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotBentOpening { get; }
Public Shared ReadOnly Property NotBentOpening As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotBentOpening {
	FailureDefinitionId^ get ();
}
static member NotBentOpening : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.BendFailures Class
Autodesk.Revit.DB Namespace